MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M0518SC2AE/mcu.h
#define BPWM_CAPIEN_CAPFIEN0_Pos         (8)                                                /*!< BPWM_T::CAPIEN: CAPFIEN0 Position          */
#define BPWM_CAPIEN_CAPFIEN0_Msk         (0x1ul << BPWM_CAPIEN_CAPFIEN0_Pos)                /*!< BPWM_T::CAPIEN: CAPFIEN0 Mask              */

#define BPWM_CAPIEN_CAPFIEN1_Pos         (9)                                                /*!< BPWM_T::CAPIEN: CAPFIEN1 Position          */
#define BPWM_CAPIEN_CAPFIEN1_Msk         (0x1ul << BPWM_CAPIEN_CAPFIEN1_Pos)                /*!< BPWM_T::CAPIEN: CAPFIEN1 Mask              */

#define BPWM_CAPIEN_CAPFIEN2_Pos         (10)                                               /*!< BPWM_T::CAPIEN: CAPFIEN2 Position          */
#define BPWM_CAPIEN_CAPFIEN2_Msk         (0x1ul << BPWM_CAPIEN_CAPFIEN2_Pos)                /*!< BPWM_T::CAPIEN: CAPFIEN2 Mask              */

#define BPWM_CAPIEN_CAPFIEN3_Pos         (11)                                               /*!< BPWM_T::CAPIEN: CAPFIEN3 Position          */
#define BPWM_CAPIEN_CAPFIEN3_Msk         (0x1ul << BPWM_CAPIEN_CAPFIEN3_Pos)                /*!< BPWM_T::CAPIEN: CAPFIEN3 Mask              */

#define BPWM_CAPIEN_CAPFIEN4_Pos         (12)                                               /*!< BPWM_T::CAPIEN: CAPFIEN4 Position          */
#define BPWM_CAPIEN_CAPFIEN4_Msk         (0x1ul << BPWM_CAPIEN_CAPFIEN4_Pos)                /*!< BPWM_T::CAPIEN: CAPFIEN4 Mask              */

#define BPWM_CAPIEN_CAPFIEN5_Pos         (13)                                               /*!< BPWM_T::CAPIEN: CAPFIEN5 Position          */
#define BPWM_CAPIEN_CAPFIEN5_Msk         (0x1ul << BPWM_CAPIEN_CAPFIEN5_Pos)                /*!< BPWM_T::CAPIEN: CAPFIEN5 Mask              */

#define BPWM_CAPIF_CRLIFn_Pos            (0)                                                /*!< BPWM_T::CAPIF: CRLIFn Position             */
#define BPWM_CAPIF_CRLIFn_Msk            (0x3ful << BPWM_CAPIF_CRLIFn_Pos)                  /*!< BPWM_T::CAPIF: CRLIFn Mask                 */

#define BPWM_CAPIF_CRLIF0_Pos            (0)                                                /*!< BPWM_T::CAPIF: CRLIF0 Position             */
#define BPWM_CAPIF_CRLIF0_Msk            (0x1ul << BPWM_CAPIF_CRLIF0_Pos)                   /*!< BPWM_T::CAPIF: CRLIF0 Mask                 */

#define BPWM_CAPIF_CRLIF1_Pos            (1)                                                /*!< BPWM_T::CAPIF: CRLIF1 Position             */
#define BPWM_CAPIF_CRLIF1_Msk            (0x1ul << BPWM_CAPIF_CRLIF1_Pos)                   /*!< BPWM_T::CAPIF: CRLIF1 Mask                 */

#define BPWM_CAPIF_CRLIF2_Pos            (2)                                                /*!< BPWM_T::CAPIF: CRLIF2 Position             */
#define BPWM_CAPIF_CRLIF2_Msk            (0x1ul << BPWM_CAPIF_CRLIF2_Pos)                   /*!< BPWM_T::CAPIF: CRLIF2 Mask                 */

#define BPWM_CAPIF_CRLIF3_Pos            (3)                                                /*!< BPWM_T::CAPIF: CRLIF3 Position             */
#define BPWM_CAPIF_CRLIF3_Msk            (0x1ul << BPWM_CAPIF_CRLIF3_Pos)                   /*!< BPWM_T::CAPIF: CRLIF3 Mask                 */

#define BPWM_CAPIF_CRLIF4_Pos            (4)                                                /*!< BPWM_T::CAPIF: CRLIF4 Position             */
#define BPWM_CAPIF_CRLIF4_Msk            (0x1ul << BPWM_CAPIF_CRLIF4_Pos)                   /*!< BPWM_T::CAPIF: CRLIF4 Mask                 */

#define BPWM_CAPIF_CRLIF5_Pos            (5)                                                /*!< BPWM_T::CAPIF: CRLIF5 Position             */
#define BPWM_CAPIF_CRLIF5_Msk            (0x1ul << BPWM_CAPIF_CRLIF5_Pos)                   /*!< BPWM_T::CAPIF: CRLIF5 Mask                 */

#define BPWM_CAPIF_CFLIFn_Pos            (8)                                                /*!< BPWM_T::CAPIF: CFLIFn Position             */
#define BPWM_CAPIF_CFLIFn_Msk            (0x3ful << BPWM_CAPIF_CFLIFn_Pos)                  /*!< BPWM_T::CAPIF: CFLIFn Mask                 */

#define BPWM_CAPIF_CFLIF0_Pos            (8)                                                /*!< BPWM_T::CAPIF: CFLIF0 Position             */
#define BPWM_CAPIF_CFLIF0_Msk            (0x1ul << BPWM_CAPIF_CFLIF0_Pos)                   /*!< BPWM_T::CAPIF: CFLIF0 Mask                 */

#define BPWM_CAPIF_CFLIF1_Pos            (9)                                                /*!< BPWM_T::CAPIF: CFLIF1 Position             */
#define BPWM_CAPIF_CFLIF1_Msk            (0x1ul << BPWM_CAPIF_CFLIF1_Pos)                   /*!< BPWM_T::CAPIF: CFLIF1 Mask                 */

#define BPWM_CAPIF_CFLIF2_Pos            (10)                                               /*!< BPWM_T::CAPIF: CFLIF2 Position             */
#define BPWM_CAPIF_CFLIF2_Msk            (0x1ul << BPWM_CAPIF_CFLIF2_Pos)                   /*!< BPWM_T::CAPIF: CFLIF2 Mask                 */

#define BPWM_CAPIF_CFLIF3_Pos            (11)                                               /*!< BPWM_T::CAPIF: CFLIF3 Position             */
#define BPWM_CAPIF_CFLIF3_Msk            (0x1ul << BPWM_CAPIF_CFLIF3_Pos)                   /*!< BPWM_T::CAPIF: CFLIF3 Mask                 */

#define BPWM_CAPIF_CFLIF4_Pos            (12)                                               /*!< BPWM_T::CAPIF: CFLIF4 Position             */
#define BPWM_CAPIF_CFLIF4_Msk            (0x1ul << BPWM_CAPIF_CFLIF4_Pos)                   /*!< BPWM_T::CAPIF: CFLIF4 Mask                 */

#define BPWM_CAPIF_CFLIF5_Pos            (13)                                               /*!< BPWM_T::CAPIF: CFLIF5 Position             */
#define BPWM_CAPIF_CFLIF5_Msk            (0x1ul << BPWM_CAPIF_CFLIF5_Pos)                   /*!< BPWM_T::CAPIF: CFLIF5 Mask                 */

#define BPWM_PBUF_PBUF_Pos               (0)                                                /*!< BPWM_T::PBUF: PBUF Position                */
#define BPWM_PBUF_PBUF_Msk               (0xfffful << BPWM_PBUF_PBUF_Pos)                   /*!< BPWM_T::PBUF: PBUF Mask                    */

#define BPWM_CMPBUF_CMPBUF_Pos           (0)                                                /*!< BPWM_T::CMPBUF: CMPBUF Position            */
#define BPWM_CMPBUF_CMPBUF_Msk           (0xfffful << BPWM_CMPBUF_CMPBUF_Pos)               /*!< BPWM_T::CMPBUF: CMPBUF Mask                */

/*@}*/ /* end of group BPWM_CONST */
/*@}*/ /* end of group BPWM */



/*---------------------- System Clock Controller -------------------------*/
/**
    @addtogroup CLK System Clock Controller (CLK)
    Memory Mapped Structure for CLK Controller
@{ */
typedef struct
{

    /**
     * PWRCON
     * ===================================================================================================
     * Offset: 0x00  System Power-down Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |XTL12M_EN |External 4~24 MHz High Speed Crystal Enable (HXT) Control (Write Protect)
     * |        |          |The bit default value is set by flash controller user configuration register CONFIG0 [26:24].
     * |        |          |When the default clock source is from external 4~24 MHz high speed crystal, this bit is set to 1 automatically.
     * |        |          |0 = External 4~24 MHz high speed crystal oscillator (HXT) Disabled.
     * |        |          |1 = External 4~24 MHz high speed crystal oscillator (HXT) Enabled.
     * |        |          |Note: This bit is the protected bit, and programming it needs to write "59h", "16h", and "88h" to address 0x5000_0100 to disable register protection.
     * |        |          |Refer to the register REGWRPROT at address GCR_BA+0x100.
     * |[2]     |OSC22M_EN |Internal 22.1184 MHz High Speed Oscillator (HIRC) Enable Control (Write Protect)
     * |        |          |0 = Internal 22.1184 MHz high speed oscillator (HIRC) Disabled.
     * |        |          |1 = Internal 22.1184 MHz high speed oscillator (HIRC) Enabled.
     * |        |          |Note: This bit is the protected bit, and programming it needs to write "59h", "16h", and "88h" to address 0x5000_0100 to disable register protection.
     * |        |          |Refer to the register REGWRPROT at address GCR_BA+0x100.
     * |[3]     |OSC10K_EN |Internal 10 KHz Low Speed Oscillator (LIRC) Enable Control (Write Protect)
     * |        |          |0 = Internal 10 kHz low speed oscillator (LIRC) Disabled.
     * |        |          |1 = Internal 10 kHz low speed oscillator (LIRC) Enabled.
     * |        |          |Note: This bit is the protected bit, and programming it needs to write "59h", "16h", and "88h" to address 0x5000_0100 to disable register protection.
     * |        |          |Refer to the register REGWRPROT at address GCR_BA+0x100.
     * |[4]     |PD_WU_DLY |Wake-up Delay Counter Enable Control (Write Protect)
     * |        |          |When the chip wakes up from Power-down mode, the clock control will delay certain clock cycles to wait system clock stable.
     * |        |          |The delayed clock cycle is 4096 clock cycles when chip work at external 4~24 MHz high speed crystal, and 256 clock cycles when chip work at internal 22.1184 MHz high speed oscillator.
     * |        |          |0 = Clock cycles delay Disabled.
     * |        |          |1 = Clock cycles delay Enabled.
     * |        |          |Note: This bit is the protected bit, and programming it needs to write "59h", "16h", and "88h" to address 0x5000_0100 to disable register protection.
     * |        |          |Refer to the register REGWRPROT at address GCR_BA+0x100.
     * |[5]     |PD_WU_INT_EN|Power-Down Mode Wake-Up Interrupt Enable Control (Write Protect)
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |        |          |Note1: The interrupt will occur when both PD_WU_STS and PD_WU_INT_EN are high.
     * |        |          |Note2: This bit is the protected bit, and programming it needs to write "59h", "16h", and "88h" to address 0x5000_0100 to disable register protection. Refer to the register REGWRPROT at address GCR_BA+0x100.
     * |[6]     |PD_WU_STS |Power-Down Mode Wake-Up Interrupt Status
     * |        |          |Set by "Power-down wake-up event", it indicates that resume from Power-down mode.
     * |        |          |The flag is set if the GPIO, UART, WDT, I2C, TIMER or BOD wake-up occurred. Write 1 to clear the bit to 0.
     * |        |          |Note: This bit is working only if PD_WU_INT_EN (PWRCON[5]) set to 1.
     * |[7]     |PWR_DOWN_EN|System Power-Down Enable Bit (Write Protect)
     * |        |          |When this bit is set to 1, Power-down mode is enabled and chip Power-down behavior will depends on the PD_WAIT_CPU bit
     * |        |          |(a) If the PD_WAIT_CPU is 0, then the chip enters Power-down mode immediately after the PWR_DOWN_EN bit set.
     * |        |          |(b) if the PD_WAIT_CPU is 1, then the chip keeps active till the CPU sleep mode is also active and then the chip enters Power-down mode (recommend)
     * |        |          |When chip wakes up from Power-down mode, this bit is cleared by hardware.
     * |        |          |User needs to set this bit again for next Power-down.
     * |        |          |In Power-down mode, external 4~24 MHz high speed crystal oscillator and the internal 22.1184 MHz high speed oscillator will be disabled in this mode, but the internal 10 kHz low speed oscillator are not controlled by Power-down mode.
     * |        |          |In Power- down mode, the PLL and system clock are disabled, and ignored the clock source selection.
     * |        |          |The clocks of peripheral are not controlled by Power-down mode, if the peripheral clock source is from the internal 10 kHz low speed oscillator.
     * |        |          |0 = Chip operating normally or chip in Idle mode because of WFI command.
     * |        |          |1 = Chip enters Power-down mode instantly or waits CPU sleep command WFI.
     * |        |          |Note: This bit is the protected bit, and programming it needs to write "59h", "16h", and "88h" to address 0x5000_0100 to disable register protection.
     * |        |          |Refer to the register REGWRPROT at address GCR_BA+0x100.
     * |[8]     |PD_WAIT_CPU|This Bit Control The Power-Down Entry Condition (Write Protect)
     * |        |          |0 = Chip enters Power-down mode when the PWR_DOWN_EN bit is set to 1.
     * |        |          |1 = Chip enters Power- down mode when the both PD_WAIT_CPU and PWR_DOWN_EN bits are set to 1 and CPU run WFI instruction.
     * |        |          |Note: This bit is the protected bit, and programming it needs to write "59h", "16h", and "88h" to address 0x5000_0100 to disable register protection.
     * |        |          |Refer to the register REGWRPROT at address GCR_BA+0x100.
     */
    __IO uint32_t PWRCON;

    /**
    * AHBCLK
    * ===================================================================================================
    * Offset: 0x04  AHB Devices Clock Enable Control Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[2]     |ISP_EN    |Flash ISP Controller Clock Enable Control
    * |        |          |0 = Flash ISP peripheral clock Disabled.
    * |        |          |1 = Flash ISP peripheral clock Enabled.
    */
    __IO uint32_t AHBCLK;

    /**
     * APBCLK
     * ===================================================================================================
     * Offset: 0x08  APB Devices Clock Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |WDT_EN    |Watchdog Timer Clock Enable Control (Write Protect)
     * |        |          |0 = Watchdog Timer clock Disabled.
     * |        |          |1 = Watchdog Timer clock Enabled.
     * |        |          |Note: This bit is the protected bit, and programming it needs to write "59h", "16h", and "88h" to address 0x5000_0100 to disable register protection.
     * |        |          |Refer to the register REGWRPROT at address GCR_BA+0x100.
     * |[2]     |TMR0_EN   |Timer0 Clock Enable Control
     * |        |          |0 = Timer0 clock Disabled.
     * |        |          |1 = Timer0 clock Enabled.
     * |[3]     |TMR1_EN   |Timer1 Clock Enable Control
     * |        |          |0 = Timer1 clock Disabled.
     * |        |          |1 = Timer1 clock Enabled.
     * |[4]     |TMR2_EN   |Timer2 Clock Enable Control
     * |        |          |0 = Timer2 clock Disabled.
     * |        |          |1 = Timer2 clock Enabled.
     * |[5]     |TMR3_EN   |Timer3 Clock Enable Control
     * |        |          |0 = Timer3 clock Disabled.
     * |        |          |1 = Timer3 clock Enabled.
     * |[6]     |FDIV_EN   |Frequency Divider Output Clock Enable Control
     * |        |          |0 = FDIV clock Disabled.
     * |        |          |1 = FDIV clock Enabled.
     * |[8]     |I2C0_EN   |I2C0 Clock Enable Control
     * |        |          |0 = I2C0 clock Disabled.
     * |        |          |1 = I2C0 clock Enabled.
     * |[9]     |I2C1_EN   |I2C1 Clock Enable Control
     * |        |          |0 = I2C1 clock Disabled.
     * |        |          |1 = I2C1 clock Enabled.
     * |[12]    |SPI0_EN   |SPI0 Clock Enable Control
     * |        |          |0 = SPI0 clock Disabled.
     * |        |          |1 = SPI0 clock Enabled.
     * |[16]    |UART0_EN  |UART0 Clock Enable Control
     * |        |          |0 = UART0 clock Disabled.
     * |        |          |1 = UART0 clock Enabled.
     * |[17]    |UART1_EN  |UART1 Clock Enable Control
     * |        |          |0 = UART1 clock Disabled.
     * |        |          |1 = UART1 clock Enabled.
     * |[18]    |UART2_EN  |UART2 Clock Enable Control
     * |        |          |0 = UART2 clock Disabled.
     * |        |          |1 = UART2 clock Enabled.
     * |[28]    |ADC_EN    |Analog-Digital-Converter (ADC) Clock Enable Control
     * |        |          |0 = ADC clock Disabled.
     * |        |          |1 = ADC clock Enabled.
     */
    __IO uint32_t APBCLK;

    /**
     * CLKSTATUS
     * ===================================================================================================
     * Offset: 0x0C  Clock status monitor Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |XTL12M_STB|External 4~24 MHz High Speed Crystal (HXT) Clock Source Stable Flag (Read Only)
     * |        |          |0 = External 4~24 MHz high speed crystal clock (HXT) is not stable or disabled.
     * |        |          |1 = External 4~24 MHz high speed crystal clock (HXT) is stable.
     * |[2]     |PLL_STB   |Internal PLL Clock Source Stable Flag (Read Only)
     * |        |          |0 = Internal PLL clock is not stable or disabled.
     * |        |          |1 = Internal PLL clock is stable.
     * |[3]     |OSC10K_STB|Internal 10 KHz Low Speed Oscillator (LIRC) Clock Source Stable Flag (Read Only)
     * |        |          |0 = Internal 10 kHz low speed oscillator clock (LIRC) is not stable or disabled.
     * |        |          |1 = Internal 10 kHz low speed oscillator clock (LIRC) is stable.
     * |[4]     |OSC22M_STB|Internal 22.1184 MHz High Speed Oscillator (HIRC) Clock Source Stable Flag (Read Only)
     * |        |          |0 = Internal 22.1184 MHz high speed oscillator (HIRC) clock is not stable or disabled.
     * |        |          |1 = Internal 22.1184 MHz high speed oscillator (HIRC) clock is stable.
     * |[7]     |CLK_SW_FAIL|Clock Switching Fail Flag (Read Only)
     * |        |          |0 = Clock switching success.
     * |        |          |1 = Clock switching failure.
     * |        |          |This bit is an index that if current system clock source is match as user defined at HCLK_S (CLKSEL[2:0]).
     * |        |          |When user switch system clock, the system clock source will keep old clock until the new clock is stable.
     * |        |          |During the period that waiting new clock stable, this bit will be an index shows system clock source is not match as user wanted.
     */
    __IO uint32_t CLKSTATUS;

    /**
     * CLKSEL0
     * ===================================================================================================
     * Offset: 0x10  Clock Source Select Control Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |HCLK_S    |HCLK Clock Source Select (Write Protect)
     * |        |          |1. Before clock switching, the related clock sources (both pre-select and new-select) must be turn on.
     * |        |          |2. The 3-bit default value is reloaded from the value of CFOSC (CONFIG0[26:24]) in user configuration register of Flash controller by any reset. Therefore the default value is either 000b or 111b.
     * |        |          |000 = Clock source from external 4~24 MHz high speed crystal oscillator clock.
     * |        |          |010 = Clock source from PLL clock.
     * |        |          |011 = Clock source from internal 10 kHz low speed oscillator clock.
     * |        |          |111 = Clock source from internal 22.1184 MHz high speed oscillator clock.
     * |        |          |Note: This bit is the protected bit, and programming it needs to write "59h", "16h", and "88h" to address 0x5000_0100 to disable register protection. Refer to the register REGWRPROT at address GCR_BA+0x100.
     * |[5:3]   |STCLK_S   |Cortex-M0 SysTick Clock Source Select (Write Protect)
     * |        |          |If SYST_CSR[2] = 1, SysTick clock source is from HCLK.
     * |        |          |If SYST_CSR[2] = 0, SysTick clock source is defined by STCLK_S(CLKSEL0[5:3]).
     * |        |          |000 = Clock source from external 4~24 MHz high speed crystal clock.
     * |        |          |010 = Clock source from external 4~24 MHz high speed crystal clock/2.
     * |        |          |011 = Clock source from HCLK/2.
     * |        |          |111 = Clock source from internal 22.1184 MHz high speed oscillator clock/2.
     * |        |          |Note1: These bits are protected bit. It means programming this bit needs to write "59h", "16h", "88h" to address 0x5000_0100 to disable register protection. Refer to the register REGWRPROT at address GCR_BA+0x100.
     * |        |          |Note2: if SysTick clock source is not from HCLK (i.e. SYST_CSR[2] = 0), SysTick clock source must less than or equal to HCLK/2.
     */
    __IO uint32_t CLKSEL0;

